{
    "adult": false,
    "also_known_as": [],
    "biography": "Award-winning actor/filmmaker Cal Nguyen had performed for film since 1998 doing commercials, infomercials, print modeling and Hollywood studio films such as \"Bedazzled\", starring Brendan Fraser and Elizabeth Hurley. After separating from military service, he shortly nabbed short film roles while returning to acting workshops, where the filmmaking bug bit him.\n\nCal's breakthrough was when he booked a lead, series regular spot as \"Jim Lecter\" in the post-apocalyptic web TV series, \"Day Zero\", which, after buying the script rights in 2011, he became the show-runner all the while continuing his role as Jim. The pilot episode \"Lethal\" alone earned him eight filmmaker awards in 2012 throughout the festival circuit and since then, the series completed nearly 3 full seasons worth 10 episodes each by 2019, and has earned over 100+ film fest nominations (many of them award wins) to include Tellys. \"Day Zero\" was the first indie web series to ever appear on Amazon Prime since 2016 after being grandfathered in from the CreateSpace DVD days. The show is listed in former ABC researcher Vincent Terrace's \"Internet Horror, Science Fiction and Fantasy Television Series, 1998-2013\".\n\nSince \"Day Zero\", he has delved into investing in other filmmakers' projects, becoming an executive producer of short films as well as features such as \"Wayward: The Prodigal Son, \"Love Everlasting\" (Lucky Blue Smith, Emily Procter) and in 2020 with \"Lucy Shimmers\" as co-executive producer and playing the part of a doctor. Earlier, he was a camera operator for the comedic web series \"Crash Pad\" and in 2018 had directed and filmed another indie web series, \"Fleet\". He is also a producer for celebrity-laden films such as Kevin Sorbo's \"Mythica\" and \"Survivor\", Amy Jo Johnson's \"Lines\", and the pilot \"Rock and a Hard Place\" starring Jim Breuer.\n\nHe has trained with some of the best coaches such as Richard Hatch of \"Battlestar Galactica\" fame, Glenn Morshower from \"Transformers\", Larry Silverberg (leading Meisner coach), casting director Jeff Johnson, and the prolific producer, director and actor, Lance Williams (\"Star Wars: Return of the Jedi\"). Cal received other types of training and experience, being a distinguished Veteran of Gulf War II, and also serving in the corporate Information Technology industry since 1996 to this day, serving in the federal government supporting the war-fighter.\n\nCal's interest in acting started out when he was very young, and along with his younger brother, they scripted and played out their own skits, comedy and otherwise. As big Star Trek fans, it was a way for Cal to start using his voice as a talent. He became a voice impressionist since his teens, performing accurate representations of William Shatner, Elvis Presley and other celebrities, but mostly known for his Bill Bixby and South Park's \"Eric Cartman\" sound-alike voices.\n\nCal had also been a major contributor to many brick-and-mortar sales due to his writings for The All Media Guide's All Game Guide, a website repository of previews, reviews and historical documentation of every video and computer game ever made.",
    "birthday": null,
    "deathday": null,
    "gender": 2,
    "homepage": null,
    "id": 1773700,
    "imdb_id": "nm2150828",
    "known_for_department": "Acting",
    "name": "Cal Nguyen",
    "place_of_birth": null,
    "popularity": 0.6,
    "profile_path": "/m0o4wO78PNkdjhbzb6cakbVnF4l.jpg"
}