{
    "adult": false,
    "also_known_as": [],
    "biography": "Derek Reid Boone was born in Salt Lake City, Utah in 1984 to Reid Boone and Debbie Lund. Derek is one of the most gifted up and coming actors and his credits to date reflect so. Derek landed his first feature role at the age of 17, in the made for television Disney movie \"Right on Track\" opposite Brie Larson and Beverly Mitchell. Since then, he has been seen in various television shows and films that include \"Yellowstone\" opposite Kevin Costner, Luke Grimes, and Cole Hauser. He played the Lead Detective opposite Sharon Stone, Garrett Hudland, and Beau Bridges in the HBO original \"Mosaic\" directed by acclaimed director Steven Soderbergh (Ocean's Eleven, Twelve, and Thirteen, Magic Mike). Derek can also be seen in an episode of \"Blood & Oil\" as the principal role simply known as the \"Roughneck\" in scenes opposite Chace Crawford and Don Johnson. Derek also landed the principal role \"Lt. Krycek\" opposite Dolph Lundgren in \"Dead Trigger\". Yet one of his biggest roles he is known for to date is playing the supporting role of the rugged, cold stoned, corrupt prison guard \"Samuel Gibbons\" in \"The Hollow Point\", opposite Patrick Wilson, Ian McShane, John Leguizamo, and from \"X-Men Origins: Wolverine\" Lynn Collins. Derek is now in production on the crime/drama \"Shadow Of Vengeance\" directed by Rob Diamond. Derek plays Dos Jonze, an ex navy seal who is pushed to the brink when the man who murdered his mother is released early from prison and his niece is beaten within an inch of her life. Dos decided to take the law into his own hands and clean up the streets himself. Derek's father was champion body builder and his mother who is now remarried, co-owns an art gallery named Lund's Fine Art in Park City, UT with her now husband Allen Lund. Derek's Step Father Allen was a big inspiration for him to get into acting and has always encouraged him to pursue his passions, as Allen did. Derek relentlessly continues to hone his craft whether it's on set or in class \"with 10 people there\". We will continue to see Derek bring to life future roles with his dedication to emotional truth to those roles.",
    "birthday": null,
    "deathday": null,
    "gender": 2,
    "homepage": null,
    "id": 1698009,
    "imdb_id": "nm1343925",
    "known_for_department": "Acting",
    "name": "Derek Boone",
    "place_of_birth": null,
    "popularity": 2.143,
    "profile_path": "/2vb8IQK3YKgADYFpvxzY1SP9Hkt.jpg"
}